src/content/blog/my-favourite-things-on-the-internet.md
---
title: "My Favourite Things on the Internet"
date: 2025-08-08
description: "A comprehensive list of the most unique things which have fascinated me on the Internet"
---


# Table of Contents

1.  [Programming in General](#orgce853ee)
2.  [Linux](#org15738de)
    1.  [Emacs](#org11eeb8b)
    2.  [Kitty](#orgb3acb25)
3.  [Internet is Fun](#orge58d338)
4.  [Physics and Mathematics](#org6f72fc6)
5.  [Automotive Scene](#org380781b)


<a id="orgce853ee"></a>

# Programming in General

-   Most comprehensive guide on how discipline meets computer science: [How To Become A Hacker](http://www.catb.org/~esr/faqs/hacker-howto.html)
-   Find answers from a random person who&rsquo;s had a random problem you&rsquo;re facing:
    [Stack Exchange](https://stackexchange.com/) and [Reddit](https://www.reddit.com/).


<a id="org15738de"></a>

# Linux


<a id="org11eeb8b"></a>

## Emacs

-   A Great Blog on Source Blocks in Org Mode: [Org Mode As Architecture Notebook |
    Wilcox Development Solutions Blog](https://blog.wilcoxd.com/2025/06/14/OrgMode-As-Architecture-Notebook/)
-   Org Mode in General: [Top (The Org Manual)](https://orgmode.org/manual/)

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


</table>


<a id="orgb3acb25"></a>

## Kitty

-   Brilliant Guide on Customizing Kitty: [kitty.conf - kitty](https://sw.kovidgoyal.net/kitty/conf/)


<a id="orge58d338"></a>

# Internet is Fun

-   The most Gamified Personal Website I&rsquo;ve Ever Seen: [Bruno Simon](https://bruno-simon.com/)
-   JavaScript that blew my mind: [Antonymph](https://lyra.horse/antonymph/)
-   HTTP Error Codes done cutely: [HTTP Cats](https://http.cat/)
-   My Guru&rsquo;s favourite things on the internet: [Essential Media - heftymouse](https://heftymouse.me/info/essential/)


<a id="org6f72fc6"></a>

# Physics and Mathematics

-   3b1b&rsquo;s [Essence of linear algebra - YouTube](https://www.youtube.com/playlist?list=PLZHQObOWTQDPD3MizzM2xVFitgF8hE_ab) made me fall in love with geometry.
-   Get an incremental foundation on blockchains: [Blockchain Demo](https://andersbrownworth.com/blockchain/hash)


<a id="org380781b"></a>

# Automotive Scene

-   Find writings of people who *feel* vehicles: [Team-BHP - India&rsquo;s Most Trusted Car
    Reviews & News](https://www.team-bhp.com/)

